Revit 2027 API
BuiltInFailures.MacroFailures Class
 Failures about module with duplicate name found during reload latest.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.MacroFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class MacroFailures
Public NotInheritable Class MacroFailures
public ref class MacroFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type MacroFailures = class end
The BuiltInFailures.MacroFailures type exposes the following members.
Properties
Name | Description
DuplicateModuleName |  Macro project with name [MacroModuleName] duplicates with central file. Delete the macro project or re-create it with another name to proceed.
Top
See Also
Reference
Autodesk.Revit.DB Namespace